MoveCall/moui/examples/widget_test/sdkconfig.defaults
# Widget Test — OnePage C61 E-Paper

CONFIG_IDF_TARGET="esp32c61"

# moui: framework + fonts + drivers used by the component tests
CONFIG_MOUI_USE_DRV_SSD1677=y

CONFIG_MOUI_USE_FONT_ASCII_6X8=y
CONFIG_MOUI_USE_FONT_INTER_16=y
CONFIG_MOUI_USE_FONT_CN_16=y
CONFIG_MOUI_USE_FONT_WQY_16=y

# widgets / features exercised by the test suite
CONFIG_MOUI_USE_LABEL=y
CONFIG_MOUI_USE_BUTTON=y
CONFIG_MOUI_USE_LIST=y
CONFIG_MOUI_USE_SLIDER=y
CONFIG_MOUI_USE_SWITCH=y
CONFIG_MOUI_USE_PROGRESS=y
CONFIG_MOUI_USE_RADIO=y
CONFIG_MOUI_USE_CHART=y
CONFIG_MOUI_USE_SCROLL=y
CONFIG_MOUI_USE_STATUSBAR=y
CONFIG_MOUI_USE_SPINNER=y
CONFIG_MOUI_USE_TAB=y
CONFIG_MOUI_USE_DROPDOWN=y
CONFIG_MOUI_USE_TEXTINPUT=y
CONFIG_MOUI_USE_GAUGE=y
CONFIG_MOUI_USE_TABLE=y
CONFIG_MOUI_USE_BTNMATRIX=y
CONFIG_MOUI_USE_CALENDAR=y
CONFIG_MOUI_USE_IMAGE=y
CONFIG_MOUI_USE_RING=y
CONFIG_MOUI_USE_KEYBOARD=y
CONFIG_MOUI_USE_EXTRA=y
CONFIG_MOUI_USE_MISC=y
CONFIG_MOUI_USE_QRCODE=y
CONFIG_MOUI_USE_ICONS=y
CONFIG_MOUI_USE_ANIM=y
CONFIG_MOUI_USE_GRID=y
CONFIG_MOUI_USE_POPUP=y
